---
kind: method
id: M:Autodesk.Revit.DB.Macros.ApplicationEntryPoint.FinishInitializationEO
source: html/d29ad4c9-3ec9-f175-bcbd-06a0a067d051.htm
---
# Autodesk.Revit.DB.Macros.ApplicationEntryPoint.FinishInitializationEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void FinishInitializationEO()
```